public class FirstDocFifthExercise {
    public static void main(String[] args) {
        //5. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
        double length;
        length = 5;
        double area;
        area = (length / 2) * length ;
        System.out.println("Площадь прямоугольника со стороной равной " + length + " равна " + area);
    }
}
